var Type = {
    "Normal"    : 0,
    "Fighting:" : 1, 
    "Flying"    : 2,
    "Poison"    : 3,
    "Ground"    : 4,
    "Rock"      : 5 ,
    "Bug"       : 6,
    "Ghost"     : 7,
    "Steel"     : 8,
    "Fire"      : 9,
    "Water"     : 10,
    "Grass"     : 11,
    "Electric"  : 12,
    "Psychic"   : 13,
    "Ice"       : 14,
    "Dragon"    : 15,
    "Dark"      : 16,
    "Fairy"     : 17
}

var TypeName = [
    ["Normal", "ノーマル", "Normal", "Normal", "Normale", "Normal", "노말"],
    ["Fighting", "かくとう", "Combat", "Kampf", "Lotta", "Peleador", "격투"],
    ["Flying", "ひこう", "Vol", "Flug", "Volante", "Volador", "비행"],
    ["Poison", "どく", "Poison", "Gift", "Veleno", "Veneno", "독"],
    ["Ground", "じめん", "Sol", "Boden", "Terra", "Tierra", "땅"],
    ["Rock", "いわ", "Roche", "Gestein", "Roccia", "Roca", "바위"],
    ["Bug", "むし", "Insecte", "Käfer", "Coleottero", "Insecto", "벌레"],
    ["Ghost", "ゴースト", "Spectre", "Geist", "Spettro", "Fantasma", "고스트"],
    ["Steel", "はがね", "Acier", "Stahl", "Acciaio", "Acero", "강철"],
    ["Fire", "ほのお", "Feu", "Feuer", "Fuoco", "Fuego", "불꽃"],
    ["Water", "みず", "Eau", "Wasser", "Acqua", "Agua", "물"],
    ["Grass", "くさ", "Plante", "Pflanze", "Erba", "Planta", "풀"],
    ["Electric", "でんき", "Électrik", "Elektro", "Elettro", "Eléctrico", "전기"],
    ["Psychic", "エスパ", "Psy", "Psycho", "Psico", "Psíquico", "에스퍼"],
    ["Ice", "こおり", "Glace", "Es", "Ghiaccio", "Heilo", "얼음"],
    ["Dragon", "ドラゴン", "Dragon", "Drache", "Drago", "Dragón", "드래곤"],
    ["Dark", "あく", "Ténèbres", "Unlicht", "Buio", "Oscuridad", "악"],
    ["Fairy", "フェアリー", "Fée", "Fee", "Folletto", "Hada", "페어리"]
];

var TypeDisplay = [
    "Type"
    //  TODO
];

//  The categories of moves with these types in Generations 1, 2, and 3.
var TypeCategory = [1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2];

//  These are double what they should be. Rightshift the result.
var TypeEffectiveness = [
    [2, 2, 2, 2, 2, 1, 2, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2],
    [4, 2, 1, 1, 2, 4, 1, 0, 4, 2, 2, 2, 2, 1, 4, 2, 4, 1],
    [2, 4, 2, 2, 2, 1, 4, 2, 1, 2, 2, 4, 1, 2, 2, 2, 2, 2],
    [2, 2, 2, 1, 1, 1, 2, 1, 0, 2, 2, 4, 2, 2, 2, 2, 2, 4],
    [2, 2, 0, 4, 2, 4, 1, 2, 4, 4, 2, 1, 4, 2, 2, 2, 2, 2],
    [2, 1, 4, 2, 1, 2, 4, 2, 1, 4, 2, 2, 2, 2, 4, 2, 2, 2],
    [2, 1, 1, 1, 2, 2, 2, 1, 1, 1, 2, 4, 2, 4, 2, 2, 4, 1],
    [0, 2, 2, 2, 2, 2, 2, 4, 1, 2, 2, 2, 2, 4, 2, 2, 1, 2],
    [2, 2, 2, 2, 2, 4, 2, 2, 1, 1, 1, 2, 1, 2, 4, 2, 2, 4],
    [2, 2, 2, 2, 2, 1, 4, 2, 4, 1, 1, 4, 2, 2, 4, 1, 2, 2],
    [2, 2, 2, 2, 4, 4, 2, 2, 2, 4, 1, 1, 2, 2, 2, 1, 2, 2],
    [2, 2, 1, 1, 4, 4, 1, 2, 1, 1, 4, 1, 2, 2, 2, 1, 2, 2],
    [2, 2, 4, 2, 0, 2, 2, 2, 2, 2, 4, 1, 1, 2, 2, 1, 2, 2],
    [2, 4, 2, 4, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 2, 2, 0, 2],
    [2, 2, 4, 2, 4, 2, 2, 2, 1, 1, 1, 4, 2, 2, 1, 4, 2, 2],
    [2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 4, 2, 0],
    [2, 1, 2, 2, 2, 2, 2, 4, 1, 2, 2, 2, 2, 4, 2, 2, 1, 1],
    [2, 4, 2, 1, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 4, 4, 2]
];

//  Also double what they should be. Used in Inverted Battle.
var InvertedTypeEffectiveness = [
    [2, 2, 2, 2, 2, 4, 2, 4, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2],
    [1, 2, 4, 4, 2, 1, 4, 4, 4, 1, 2, 2, 2, 4, 1, 2, 1, 4],
    [2, 1, 2, 2, 2, 4, 1, 2, 4, 2, 2, 1, 4, 2, 2, 2, 2, 2],
    [2, 2, 2, 4, 4, 4, 2, 4, 4, 2, 2, 1, 2, 2, 2, 2, 2, 1],
    [2, 2, 4, 1, 2, 1, 4, 2, 1, 1, 2, 4, 1, 2, 2, 2, 2, 2],
    [2, 4, 1, 2, 4, 2, 1, 2, 4, 1, 2, 2, 2, 2, 1, 2, 2, 2],
    [2, 4, 4, 4, 2, 2, 2, 4, 4, 4, 2, 1, 2, 1, 2, 2, 1, 4],
    [4, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 1, 2, 2, 4, 1],
    [2, 2, 2, 2, 2, 1, 2, 2, 4, 4, 4, 2, 4, 2, 1, 2, 2, 1],
    [2, 2, 2, 2, 2, 4, 1, 2, 1, 4, 4, 2, 1, 1, 2, 4, 2, 2],
    [2, 2, 2, 2, 1, 1, 2, 2, 2, 1, 4, 4, 2, 2, 2, 4, 2, 2],
    [2, 2, 4, 4, 1, 1, 4, 2, 4, 4, 1, 4, 2, 2, 2, 4, 2, 2],
    [2, 2, 1, 2, 4, 2, 2, 2, 2, 2, 1, 4, 4, 2, 2, 4, 2, 2],
    [2, 1, 2, 1, 2, 2, 2, 2, 4, 2, 2, 2, 2, 4, 2, 2, 4, 2],
    [2, 2, 1, 2, 1, 2, 2, 2, 4, 4, 4, 1, 2, 2, 4, 1, 2, 2],
    [2, 2, 2, 2, 2, 2, 2, 2, 4, 2, 2, 2, 2, 2, 2, 1, 2, 4],
    [2, 4, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 1, 2, 2, 4, 4],
    [2, 1, 2, 4, 2, 2, 2, 2, 4, 4, 2, 2, 2, 2, 2, 1, 1, 2]
];

var HiddenPowerType = function (ivs) {
    return Math.floor(
           (ivs.[0] && 1
        +   ivs.[1] && 2
        +   ivs.[2] && 4
        +   ivs.[3] && 8
        +   ivs.[4] && 16
        +   ivs.[5] && 32
        ) * 15 / 63) + ;
}